Repository: AynixTech/wecoop-app
Catalog: lib/l10n/app_*.arb
Languages: it

source: Hello
it: Ciao

# welcome
source: Welcome to WECOOP! Explore events, services and projects near you.
it: Benvenuta su WECOOP! Esplora eventi, servizi e progetti vicino a te.

source: User
it: Utente

source: Profile
it: Profilo

# calendar
source: Requests
it: Richieste

source: Projects
it: Progetti

source: Services
it: Servizi

source: Notifications
it: Notifiche

source: Login
it: Accedi

# logoutConfirm
source: Logged out successfully
it: Logout effettuato

source: Remember password
it: Ricorda password

# loginButton
source: LOGIN
it: ACCEDI

# loginError
source: Login failed
it: Login fallito

source: Network error
it: Errore di rete

source: email not available
it: email non disponibile

# memberCard
source: WECOOP Member Card
it: Tessera Socio WECOOP

source: Card Number
it: N° Tessera

source: Card not available
it: Tessera non disponibile

source: Open digital card
it: Apri tessera digitale

source: Preferences
it: Preferenze

source: Language
it: Lingua

source: Area of interest
it: Area di interesse

source: Participation history
it: Storico partecipazioni

source: Italian
it: Italiano

source: English
it: Inglese

source: Spanish
it: Spagnolo

source: Arabic
it: Arabo

source: Culture
it: Cultura

source: Training
it: Formazione

source: Volunteering
it: Volontariato

source: Social services
it: Servizi sociali

# servicesTitle
source: 🛠️ Services
it: 🛠️ Servizi

# welcomeService
source: Welcome
it: Accoglienza

# taxMediationService
source: Tax mediation
it: Mediazione fiscale

# accountingService
source: Accounting support
it: Supporto contabile

source: See all
it: Vedi tutti

source: 📅 Upcoming events
it: 📅 Prossimi eventi

source: 🤝 Active projects
it: 🤝 Progetti attivi

source: 📰 Latest news
it: 📰 Ultime notizie

source: ⚡ Quick access
it: ⚡ Accesso rapido

# eventInterculturalDinner
source: Intercultural Dinner
it: Cena Interculturale

# eventSewingLab
source: Sewing Workshop
it: Laboratorio di cucito

# eventItalianCourse
source: Italian Course
it: Corso di italiano

# projectMafaldaDesc
source: Youth and inclusion
it: Giovani e inclusione

# projectWomentorDesc
source: Mentoring between women
it: Mentoring tra donne

# projectSportunityDesc
source: Sport and community
it: Sport e comunità

source: Loading...
it: Caricamento...

# noNews
source: No news available
it: Nessuna notizia disponibile

source: Refresh
it: Aggiorna

source: My Requests
it: Le Mie Richieste

# allRequests
source: All
it: Tutte

source: Pending payment
it: In attesa pagamento

source: Processing
it: In lavorazione

source: Completed
it: Completate

source: Cancelled
it: Annullate

source: Request Details
it: Dettaglio Richiesta

source: Service
it: Servizio

source: Description
it: Descrizione

source: Request Date
it: Data Richiesta

source: Status
it: Stato

# paymentInfo
source: Payment Information
it: Informazioni Pagamento

source: Payment Status
it: Stato Pagamento

source: Paid
it: Pagato

source: Not paid
it: Non pagato

# paymentMethod
source: Method
it: Metodo

source: Payment Date
it: Data Pagamento

source: Transaction ID
it: ID Transazione

source: Amount
it: Importo

source: Pay now
it: Paga ora

source: Cannot open payment link
it: Impossibile aprire il link di pagamento

# noRequestsForDay
source: No requests for this day
it: Nessuna richiesta per questo giorno

# noRequests
source: No requests found
it: Nessuna richiesta trovata

source: Close
it: Chiudi

# loginToAccessServices
source: Log in to access all services reserved for members.
it: Effettua il login per accedere a tutti i servizi riservati ai soci.

# membershipPendingApproval
source: Your membership application is pending approval.
it: La tua richiesta di adesione come socio è in fase di approvazione.

# confirmationWithin24to48Hours
source: You will receive an email confirmation within 24-48 hours.
it: Riceverai una conferma via email entro 24-48 ore.

# onceApprovedAccessAllServices
source: Once approved, you will be able to access all services.
it: Una volta approvata, potrai accedere a tutti i servizi.

# toAccessServicesBecomeMember
source: To access {serviceName} services you must be a WECOOP member.
it: Per accedere ai servizi di {serviceName} devi essere socio di WECOOP.

# becomeMemberToAccess
source: Become a member to access:
it: Diventa socio per accedere a:

# whyBecomeMember
source: Why become a member?
it: Perché diventare socio?

source: Operation completed
it: Operazione completata

# fiscalCodeMustBe16Chars
source: Tax ID must be 16 characters
it: Il codice fiscale deve essere di 16 caratteri

# birthPlace
source: Place of Birth
it: Luogo di Nascita

source: Invalid postal code
it: CAP non valido

source: Invalid email
it: Email non valida

# fillFollowingFields
source: Fill in the following fields
it: Compila i seguenti campi

# sendingError
source: Error during submission
it: Errore durante l'invio

source: Political Asylum
it: Asilo Politico

# internationalProtectionRequest
source: The international protection request is a delicate process. We will help you prepare the documentation.
it: La richiesta di protezione internazionale è un processo delicato. Ti aiuteremo a preparare la documentazione.

source: International Protection
it: Protezione Internazionale

source: Full name
it: Nome completo

source: Date of birth
it: Data di nascita

source: Country of origin
it: Paese di origine

source: Date of arrival in Italy
it: Data di arrivo in Italia

source: Reason for request
it: Motivo della richiesta

source: Political persecution
it: Persecuzione politica

source: Religious persecution
it: Persecuzione religiosa

# persecutionSexualOrientation
source: Persecution for sexual orientation
it: Persecuzione per orientamento sessuale

source: War
it: Guerra

source: Other
it: Altro

source: Situation description
it: Descrizione situazione

# hasFamilyInItaly
source: Do you have family in Italy?
it: Hai familiari in Italia?

source: Additional notes
it: Note aggiuntive

source: Start request
it: Inizia la richiesta

source: Tourist Visa Request
it: Richiesta Visa per Turismo

source: Tax Mediation
it: Mediazione Fiscale

source: Accounting Support
it: Supporto Contabile

source: Residence Permit
it: Permesso di Soggiorno

source: Yes
it: Sì

# selectFiscalService
source: Select tax service
it: Seleziona il servizio fiscale

# tax730Declaration
source: 730 - Income Tax Return
it: 730 - Dichiarazione dei Redditi

# tax730Description
source: Form 730 preparation for employees and pensioners
it: Compilazione modello 730 per dipendenti e pensionati

source: Individual Person
it: Persona Fisica

# individualPersonDescription
source: Income tax return for individuals
it: Dichiarazione redditi per persone fisiche

source: Taxpayer type
it: Tipologia contribuente

source: Employee
it: Lavoratore dipendente

source: Pensioner
it: Pensionato

source: Fiscal year
it: Anno fiscale

# hasDeductibleExpenses
source: Do you have deductible expenses?
it: Hai spese detraibili/deducibili?

# notesAndAdditionalInfo
source: Notes and additional information
it: Note e informazioni aggiuntive

source: Income type
it: Tipologia di reddito

source: Employed work
it: Lavoro dipendente

source: Self-employed
it: Lavoro autonomo

source: Pension
it: Pensione

source: Capital income
it: Redditi da capitale

source: Other income
it: Redditi diversi

source: Multiple types
it: Più tipologie

# hasProperties
source: Do you own properties?
it: Hai immobili?

source: Details and notes
it: Dettagli e note
